littleclock2/MSPM0-Examples/M0-FPGA/M0+FPGA_V1.0_资料/【2】Software&Examples/MSPM0G3507_V1.0/ADC_TEST1/Core/inc/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000




/* Defines for ADC12_0 */
#define ADC12_0_INST                                                        ADC0
#define ADC12_0_INST_IRQHandler                                  ADC0_IRQHandler
#define ADC12_0_INST_INT_IRQN                                    (ADC0_INT_IRQn)
#define ADC12_0_ADCMEM_0                                      DL_ADC12_MEM_IDX_0
#define ADC12_0_ADCMEM_0_REF                   DL_ADC12_REFERENCE_VOLTAGE_INTREF
#define ADC12_0_ADCMEM_0_REF_VOLTAGE                                        2.50
#define GPIO_ADC12_0_C0_PORT                                               GPIOA
#define GPIO_ADC12_0_C0_PIN                                       DL_GPIO_PIN_27


/* Defines for VREF */
#define VREF_VOLTAGE_MV                                                     2500
#define GPIO_VREF_VREFPOS_PORT                                             GPIOA
#define GPIO_VREF_VREFPOS_PIN                                     DL_GPIO_PIN_23
#define GPIO_VREF_IOMUX_VREFPOS                                  (IOMUX_PINCM53)
#define GPIO_VREF_IOMUX_VREFPOS_FUNC                IOMUX_PINCM53_PF_UNCONNECTED




/* Port definition for Pin Group LED */
#define LED_PORT                                                         (GPIOA)

/* Defines for PIN_1: GPIOA.8 with pinCMx 19 on package pin 54 */
#define LED_PIN_1_PIN                                            (DL_GPIO_PIN_8)
#define LED_PIN_1_IOMUX                                          (IOMUX_PINCM19)
/* Port definition for Pin Group GPIO_GRP_0 */
#define GPIO_GRP_0_PORT                                                  (GPIOB)

/* Defines for CS: GPIOB.0 with pinCMx 12 on package pin 47 */
#define GPIO_GRP_0_CS_PIN                                        (DL_GPIO_PIN_0)
#define GPIO_GRP_0_CS_IOMUX                                      (IOMUX_PINCM12)
/* Defines for DC: GPIOB.6 with pinCMx 23 on package pin 58 */
#define GPIO_GRP_0_DC_PIN                                        (DL_GPIO_PIN_6)
#define GPIO_GRP_0_DC_IOMUX                                      (IOMUX_PINCM23)
/* Defines for D0: GPIOB.9 with pinCMx 26 on package pin 61 */
#define GPIO_GRP_0_D0_PIN                                        (DL_GPIO_PIN_9)
#define GPIO_GRP_0_D0_IOMUX                                      (IOMUX_PINCM26)
/* Defines for D1: GPIOB.8 with pinCMx 25 on package pin 60 */
#define GPIO_GRP_0_D1_PIN                                        (DL_GPIO_PIN_8)
#define GPIO_GRP_0_D1_IOMUX                                      (IOMUX_PINCM25)
/* Port definition for Pin Group KEY */
#define KEY_PORT                                                         (GPIOA)

/* Defines for H1: GPIOA.0 with pinCMx 1 on package pin 33 */
#define KEY_H1_PIN                                               (DL_GPIO_PIN_0)
#define KEY_H1_IOMUX                                              (IOMUX_PINCM1)
/* Defines for H2: GPIOA.1 with pinCMx 2 on package pin 34 */
#define KEY_H2_PIN                                               (DL_GPIO_PIN_1)
#define KEY_H2_IOMUX                                              (IOMUX_PINCM2)
/* Defines for H3: GPIOA.7 with pinCMx 14 on package pin 49 */
#define KEY_H3_PIN                                               (DL_GPIO_PIN_7)
#define KEY_H3_IOMUX                                             (IOMUX_PINCM14)
/* Defines for H4: GPIOA.12 with pinCMx 34 on package pin 5 */
#define KEY_H4_PIN                                              (DL_GPIO_PIN_12)
#define KEY_H4_IOMUX                                             (IOMUX_PINCM34)
/* Defines for V1: GPIOA.13 with pinCMx 35 on package pin 6 */
#define KEY_V1_PIN                                              (DL_GPIO_PIN_13)
#define KEY_V1_IOMUX                                             (IOMUX_PINCM35)
/* Defines for V2: GPIOA.14 with pinCMx 36 on package pin 7 */
#define KEY_V2_PIN                                              (DL_GPIO_PIN_14)
#define KEY_V2_IOMUX                                             (IOMUX_PINCM36)
/* Defines for V3: GPIOA.17 with pinCMx 39 on package pin 10 */
#define KEY_V3_PIN                                              (DL_GPIO_PIN_17)
#define KEY_V3_IOMUX                                             (IOMUX_PINCM39)
/* Defines for V4: GPIOA.18 with pinCMx 40 on package pin 11 */
#define KEY_V4_PIN                                              (DL_GPIO_PIN_18)
#define KEY_V4_IOMUX                                             (IOMUX_PINCM40)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_ADC12_0_init(void);
void SYSCFG_DL_VREF_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
